2024-09-24-ImplementBP/notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>An In-Depth Introduction to Backpropagation and Automatic Differentiation</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href= "https://gongzhitaao.org/orgcss/org.css" rel="stylesheet" type="text/css" />
<link href= "https://dou-meishi.github.io/org-blog/static/dou-org-blog.css" rel="stylesheet" type="text/css" />
<!-- Math Support by KaTeX -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css" integrity="sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">24 Sep 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-09-24-ImplementBP/notes.html">An In-Depth Introduction to Backpropagation and Automatic Differentiation</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbeda738">Four ways to calculate gradients</a></li>
<li><a href="#orgd00098b">Automatic differentiation</a>
<ul>
<li><a href="#org9654957">Forward-mode AD</a></li>
<li><a href="#org006a24b">Reverse-mode AD</a></li>
</ul>
</li>
<li><a href="#orgd268b38">Examples: reverse-mode AD for scalar functions</a></li>
<li><a href="#org54bdb65">Jacobian-vector product</a></li>
<li><a href="#org4d46603">Implement forward-mode and reverse-mode AD</a></li>
<li><a href="#orgf719635">Hessian-vector product</a></li>
<li><a href="#orgdac8ba1">Conclusion</a></li>
<li><a href="#orgcd67d14">References</a></li>
<li><a href="#org54ca842">Appendix: An inductive proof of reverse-mode AD formula</a></li>
<li><a href="#org4876bdc">Appendix: JVP and VJP for linear maps</a></li>
<li><a href="#org6fd5062">Appendix: Overview of the Python Implementation</a></li>
</ul>
</div>
</nav>
<p>
Backpropagation and automatic differentiation (AD) are fundamental
components of modern deep learning frameworks. However, many
practitioners pay little attention to their implementations and may
regard them as some sort of "black magic". It indeed looks like magic
that PyTorch can virtually calculate derivatives of an arbitrary
function defined by the user, and even accommodate flow control
elements like conditional execution, which is mathematically not
differentiable. Although we understand that mathematically they
primarily employ the chain rule, it remains unclear how they
efficiently apply it to a function whose form is entirely unknown and
will be determined by the user.
</p>

<p>
In this post, I will introduce the underlying mechanisms of AD and
give a simple implementatin for demonstration. Moreover, I want to
clarify the following facts of AD.
</p>

<ol class="org-ol">
<li>Backpropagation is a special case of AD that runs in reverse
mode. Backpropagation is a specialized algorithm for calculating
gradients of neural networks. On the other hand, AD refers to a
general technique that generates numerical derivative evaluations
rather than derivative expressions. Besides reverse-mode AD, there
are forward-mode AD and even reverse-on-forward AD.</li>

<li>AD is neither traditional numerical differentiation nor symbolic
differentiation. However, AD does in fact provide numerical values
of derivatives and it does so by using symbolic rules of
differentiation, giving it a two-sided nature that is partly
symbolic and partly numerical.  To some extent, AD should be
regarded as an efficient way to <i>evaluate</i> the derivative expressions
without the need to explicitly construct their mathematical expressions.</li>

<li>AD is guaranteed to take no more than 6 times the computational
cost of a single function evaluation. In practice, the overhead is
typically closer to a factor of 2 or 3 (Bishop &amp; Bishop, 2024,
p. 250; see also Baydin et al., 2018, p. 16).</li>

<li>Although evaluating the Hessian matrix \(H\) of some scalar function
\(f: \mathbb{R}^n \to \mathbb{R}\) by AD has \(\mathcal{O}(n^2)\) complexity, evaluating the
Hessian-vector product \(H v\) by reverse-on-forward AD has only
\(\mathcal{O}(n)\) complexity. The same difference exists between evaluating
the Jacobian matrix \(J\) of some vector-valued function \(\mathbb{R}^n \to \mathbb{R}^m\)
and evaluating the Jacobian-vector product \(Jv\).</li>
</ol>

<p>
The original motivation of this post is <a href="https://github.com/datac182fa24/datac182_hw1_student">the first homework assignment</a>
of <a href="https://datac182fa24.github.io/">Data C182</a>, which requires to implement the forward pass and
backward pass of common neural network layers, including affine layer,
dropout layer, batchnorm layer and so on. While scanning through the
recommended textbook (Bishop &amp; Bishop, 2024), I notice that there are
not only reverse-mode AD, which is a general version of
backpropagation, and also forward-mode AD, which can be used in
combine with reverse-mode AD to efficiently compute the
Hessian-vector product. After reading the survey paper (Baydin et al.,
2018), I finally open up the "balck-box" of automatic differentiation
hidden in PyTorch and have a clearer understanding of AD.
</p>
<div id="outline-container-orgbeda738" class="outline-2">
<h2 id="orgbeda738">Four ways to calculate gradients</h2>
<div class="outline-text-2" id="text-orgbeda738">
<p>
<i>Adapted from the textbook (Bishop &amp; Bishop, 2024) and the survey paper
(Baydin et al., 2018).</i>
</p>

<p>
Methods for the computation of derivatives in computer programs can be
classified into four categories:
</p>

<ol class="org-ol">
<li>manually working out derivatives and coding them;</li>

<li>numerical differentiation using finite difference approximations;</li>

<li>symbolic differentiation using expression manipulation in computer
algebra systems such as Mathematica, Maxima, and Maple;</li>

<li>automatic differentiation, also called algorithmic differentiation.</li>
</ol>

<p>
Numerical approximations of derivatives are inherently ill-conditioned
and unstable. It suffers truncation and round-off errors inflicted by
the limited precision of computations and the chosen value of the step
size \(h\). Truncation error tends to zero as \(h \to 0\). However, as \(h\)
is decreased, round-off error increases and becomes
dominant. Moreover, numerical differentiation requires \(\mathcal{O}(n)\)
evaluations (for gradients in \(n\) dimensions) of the original
function, which is the main obstacle to its usefulness in machine
learning where \(n\) can be as large as millions or billions in
state-of-the-art deep learning models.
</p>

<p>
Symbolic differentiation, on the other hand, faces the problem called
<i>expression well</i>, i.e., the resulting expressions for derivatives can
become exponentially longer than the original function. A further
major drawback with symbolic differentiation is that it requires that
the expression to be differentiated is expressed in closed form. It
therefore excludes important control flow operations such as loops,
recursions, conditional execution, and procedure calls, which are
valuable constructs that we might wish to use when defining the
network function.
</p>

<p>
The first approach, which formed the mainstay of neural networks for
many years, is to derive the backpropagation equations by hand and
then to implement them explicitly in software. If this is done
carefully it results in efficient code that gives precise results that
are accurate to numerical precision. However, the process of deriving
the equations as well as the process of coding them both take time and
are prone to errors. If the model is altered, both the forward and
backward implementations need to be changed in unison. This effort can
easily become a limitation on how quickly and effectively different
architectures can be explored empirically.
</p>

<p>
Modern deep learning frameworks use automatic differentiation to
evaluate gradients of neural networks. Unlike symbolic
differentiation, the goal of automatic differentiation is not to find
a mathematical expression for the derivatives but to have the computer
automatically generate the code that implements the gradient
calculations given only the code for the forward propagation
equations. It is accurate to machine precision, just as with symbolic
differentiation, but is more efficient because it is able to exploit
intermediate variables used in the definition of the forward
propagation equations and thereby avoid redundant evaluations.
</p>
</div>
</div>
