2024-09-24-ImplementBP/notes.org
** Automatic differentiation

Automatic differentiation (AD) can be thought of as performing a
non-standard interpretation of a computer program where this
interpretation involves augmenting the standard computation with the
calculation of various derivatives. All numerical computations are
ultimately compositions of a finite set of elementary operations for
which derivatives are known, and combining the derivatives of the
constituent operations through the chain rule gives the derivative of
the overall composition. Usually these elementary operations include
the binary arithmetic operations, the unary sign switch, and
transcendental functions such as the exponential, the logarithm, and
the trigonometric functions. Besides that, users can define their own
operations, as long as they provide their derivative functions.

For a given function $y=f(x)$ for differentiation, assume it can be
described by the following computational graph
#+BEGIN_export HTML
$$ \begin{aligned}
z_0 &= x, \\
z_1 &= \phi_1(z_0), \\
z_2 &= \phi_2(z_0, z_1), \\
&\cdots \\
z_k &= \phi_k(z_0, z_1, z_2, \ldots, z_{k-1}), \\
&\cdots \\
z_N &= \phi_N(z_0, z_1, z_2, \ldots, z_{k-1}, \ldots, z_{N-1}), \\
y &= z_N,
\end{aligned} $$
#+END_export
where $\phi_1, \phi_2, \ldots, \phi_N$ are elementary operations whose
derivatives $\partial \phi_1, \partial \phi_2, \ldots, \partial \phi_N$ are known.  Obviously, any
computational graph is a directed acyclic graph and always falls
within the considered case. In practice, the initial variable $z_0$
contains all leaf nodes of the computational graph, and $\phi_k$ may only
depends on one or two variables in $\{z_\alpha\}_{\alpha=0}^{k-1}$.

/Notations./ For a vector $x$, we denote by $x^{(i)}$ the \(i\)-th
component of $x$, i.e., $x = (x^{(0)}, x^{(1)}, x^{(2)}
\ldots)^\intercal$. For a vector $y$ that depends on $x$, the Jacobian matrix
$\partial y/\partial x$ is defined by $$ \biggl(\frac{\partial y}{\partial x}\biggr)_{ij} =
\frac{\partial y^{(i)}}{\partial x^{(j)}}. $$ For a function $y=f(x)$, we also use $\partial
f$ to represent the Jacobian matrix $\partial y / \partial x$. With this notation,
the chain rule can be written as $\partial (f \circ g ) = [\partial f] [\partial g]$. It
should be noted that the Jacobian matrix $\partial f$ of a scalar function is
a row vector in this notation.

*** Forward-mode AD

Forward-mode AD is the conceptually most simple type: /apply symbolic
differentiation at the elementary operation level and keep
intermediate numerical results, in lockstep with the evaluation of the
main function/. Viewing $z_k$ ($k=1, 2, \ldots, N$) as functions of
$x$, we differentiate the function $$ z_k(x) = \phi_k(z_0(x), z_1(x),
z_2(x), \ldots, z_{k-1}(x)) $$ w.r.t. $x$ and obtain
\begin{equation}\tag{chain-rule: FAD}
\frac{\partial z_k}{\partial x} =
\sum_{\alpha=0}^{k-1} \frac{\partial \phi_k}{\partial z_\alpha} \frac{\partial z_\alpha}{\partial x}, \quad k=1,
2, \ldots, N.
\end{equation}
Starting from $\partial z_0 / \partial x = I$, we evaluate $\partial z_k / \partial x$ in
accordance with the evaluation of $z_k$. When finally we obtain
$y=z_N$, the derivative $\partial y/\partial x=\partial z_N/ \partial x$ is also obtained.
#+BEGIN_export HTML
$$ \begin{aligned}
\frac{\partial z_1}{\partial x} &= \frac{\partial \phi_1}{\partial z_0} \frac{\partial z_0}{\partial x}, \\
\frac{\partial z_2}{\partial x} &= \frac{\partial \phi_2}{\partial z_0} \frac{\partial z_0}{\partial x} + \frac{\partial \phi_2}{\partial z_1} \frac{\partial z_1}{\partial x}, \\
&\cdots \\
\frac{\partial z_N}{\partial x} &= \sum_{\alpha=0}^{N-1} \frac{\partial \phi_k}{\partial z_\alpha} \frac{\partial z_\alpha}{\partial x}.
\end{aligned} $$
#+END_export
In other words, these equations are *evaluated from top to the bottom,
row by row*.

*** Reverse-mode AD

Reverse-mode AD differes from forward-mode AD by using different
auxiliary variables. In forward-mode AD, the auxiliary variables are
$\partial z_k / \partial x$ (called /tangent/ variables), and are evaluated from $k=1$
to $k=N$. In reverse-mode AD, the auxiliary variables are $\partial y / \partial
z_k$ (called /adjoint/ variables), and are evaluated from $k=N-1$ to
$k=0$. For any $0 \leq k \leq N-1$, we regard $\mathcal{Z}_k := \{z_\alpha\}_{\alpha=0}^{k}$ as
independent variables and view $\{z_\beta\}_{\beta=k+1}^N$ as functions of
$\mathcal{Z}_k$. Thus, we can differentiate $$ y = y(z_0, z_1, \ldots, z_k) $$
w.r.t. $z_k$ and obtain (see [[appendix:proof-reverse-mode][the appendix]] for an inductive proof)
\begin{equation}\tag{chain-rule: RAD}
\frac{\partial y}{\partial z_{k}} = \sum_{\beta=k+1}^N \frac{\partial y}{\partial z_\beta} \frac{\partial \phi_\beta}{\partial
z_k}, \quad k=N-1, N-2, \ldots, 0.
\end{equation}
The partial derivative $\partial y/ \partial
z_k$ should be understood as the sensitivity of $y$ w.r.t. $z_k$. An
intuitive explanation of this formula is: /when $z_k$ changes, the
change of the final output is determined by the cumulative effect of
changes in downstream variables/ $\{z_\beta\}_{\beta=k+1}^N$.

Starting from $\partial y / \partial z_N = I$, we evaluate $\partial y / \partial z_k$
reversely.
#+BEGIN_export HTML
$$ \begin{aligned}
\frac{\partial y}{\partial z_{N-1}} &= {\color{blue}\frac{\partial y}{\partial z_{N}} \frac{\partial \phi_N}{\partial z_{N-1}}}, \\
\frac{\partial y}{\partial z_{N-2}} &= {\color{blue} \frac{\partial y}{\partial z_{N}} \frac{\partial \phi_N}{\partial z_{N-2}}} + {\color{green} \frac{\partial y}{\partial z_{N-1}} \frac{\partial \phi_{N-1}}{\partial z_{N-2}}}, \\
\frac{\partial y}{\partial z_{N-3}} &= {\color{blue} \frac{\partial y}{\partial z_{N}} \frac{\partial \phi_N}{\partial z_{N-3}}} + {\color{green} \frac{\partial y}{\partial z_{N-1}} \frac{\partial \phi_{N-1}}{\partial z_{N-3}}} + \frac{\partial y}{\partial z_{N-2}} \frac{\partial \phi_{N-2}}{\partial z_{N-3}}, \\
&\cdots \\
\frac{\partial y}{\partial z_{0}} &= \sum_{\beta=1}^N \frac{\partial y}{\partial z_\beta} \frac{\partial \phi_\beta}{\partial z_k}.
\end{aligned} $$
#+END_export
Initially, all adjoint variables are set to 0 except $\partial y/\partial z_N$,
which is set to $I$.  First, we compute the blue terms $\frac{\partial y}{\partial
z_N}\frac{\partial \phi_N}{\partial z_k}$ and add them to the corresponding adjoint
variable $\partial y/\partial z_k$. In the next step, we compute the green terms
$\frac{\partial y}{\partial z_{N-1}}\frac{\partial \phi_{N-1}}{\partial z_k}$ and add them to the
corresponding adjoint variable $\partial y/\partial z_k$. Repeat this process until
all terms listed above have been calculated. Then, the accumulated
values in adjoint variables are theire true values.

In other words, these equations are *evaluated from left to right,
column by column*. After the evaluation of column $\beta$, all adjoint
variables $\partial y/ \partial z_k$ for $k \geq \beta-1$ has been obtained.

It should be noted that the reverse calculations of $\partial y/ \partial
z_k$ actually happens in the second phase of a two-phase process,
while intermediate variables $z_k$ are calculated in the first
phase. This is different from forward-mode AD, where $\partial z_k / \partial x$
and $z_k$ are calculated simultaneously and in a forward manner.

