2024-09-24-ImplementBP/notes.html
<div id="outline-container-orgd00098b" class="outline-2">
<h2 id="orgd00098b">Automatic differentiation</h2>
<div class="outline-text-2" id="text-orgd00098b">
<p>
Automatic differentiation (AD) can be thought of as performing a
non-standard interpretation of a computer program where this
interpretation involves augmenting the standard computation with the
calculation of various derivatives. All numerical computations are
ultimately compositions of a finite set of elementary operations for
which derivatives are known, and combining the derivatives of the
constituent operations through the chain rule gives the derivative of
the overall composition. Usually these elementary operations include
the binary arithmetic operations, the unary sign switch, and
transcendental functions such as the exponential, the logarithm, and
the trigonometric functions. Besides that, users can define their own
operations, as long as they provide their derivative functions.
</p>

<p>
For a given function \(y=f(x)\) for differentiation, assume it can be
described by the following computational graph
</p>
$$ \begin{aligned}
z_0 &= x, \\
z_1 &= \phi_1(z_0), \\
z_2 &= \phi_2(z_0, z_1), \\
&\cdots \\
z_k &= \phi_k(z_0, z_1, z_2, \ldots, z_{k-1}), \\
&\cdots \\
z_N &= \phi_N(z_0, z_1, z_2, \ldots, z_{k-1}, \ldots, z_{N-1}), \\
y &= z_N,
\end{aligned} $$
<p>
where \(\phi_1, \phi_2, \ldots, \phi_N\) are elementary operations whose
derivatives \(\partial \phi_1, \partial \phi_2, \ldots, \partial \phi_N\) are known.  Obviously, any
computational graph is a directed acyclic graph and always falls
within the considered case. In practice, the initial variable \(z_0\)
contains all leaf nodes of the computational graph, and \(\phi_k\) may only
depends on one or two variables in \(\{z_\alpha\}_{\alpha=0}^{k-1}\).
</p>

<p>
<i>Notations.</i> For a vector \(x\), we denote by \(x^{(i)}\) the \(i\)-th
component of \(x\), i.e., \(x = (x^{(0)}, x^{(1)}, x^{(2)}
\ldots)^\intercal\). For a vector \(y\) that depends on \(x\), the Jacobian matrix
\(\partial y/\partial x\) is defined by \[ \biggl(\frac{\partial y}{\partial x}\biggr)_{ij} =
\frac{\partial y^{(i)}}{\partial x^{(j)}}. \] For a function \(y=f(x)\), we also use \(\partial
f\) to represent the Jacobian matrix \(\partial y / \partial x\). With this notation,
the chain rule can be written as \(\partial (f \circ g ) = [\partial f] [\partial g]\). It
should be noted that the Jacobian matrix \(\partial f\) of a scalar function is
a row vector in this notation.
</p>
</div>
<div id="outline-container-org9654957" class="outline-3">
<h3 id="org9654957">Forward-mode AD</h3>
<div class="outline-text-3" id="text-org9654957">
<p>
Forward-mode AD is the conceptually most simple type: <i>apply symbolic
differentiation at the elementary operation level and keep
intermediate numerical results, in lockstep with the evaluation of the
main function</i>. Viewing \(z_k\) (\(k=1, 2, \ldots, N\)) as functions of
\(x\), we differentiate the function \[ z_k(x) = \phi_k(z_0(x), z_1(x),
z_2(x), \ldots, z_{k-1}(x)) \] w.r.t. \(x\) and obtain
</p>
\begin{equation}\tag{chain-rule: FAD}
\frac{\partial z_k}{\partial x} =
\sum_{\alpha=0}^{k-1} \frac{\partial \phi_k}{\partial z_\alpha} \frac{\partial z_\alpha}{\partial x}, \quad k=1,
2, \ldots, N.
\end{equation}
<p>
Starting from \(\partial z_0 / \partial x = I\), we evaluate \(\partial z_k / \partial x\) in
accordance with the evaluation of \(z_k\). When finally we obtain
\(y=z_N\), the derivative \(\partial y/\partial x=\partial z_N/ \partial x\) is also obtained.
</p>
$$ \begin{aligned}
\frac{\partial z_1}{\partial x} &= \frac{\partial \phi_1}{\partial z_0} \frac{\partial z_0}{\partial x}, \\
\frac{\partial z_2}{\partial x} &= \frac{\partial \phi_2}{\partial z_0} \frac{\partial z_0}{\partial x} + \frac{\partial \phi_2}{\partial z_1} \frac{\partial z_1}{\partial x}, \\
&\cdots \\
\frac{\partial z_N}{\partial x} &= \sum_{\alpha=0}^{N-1} \frac{\partial \phi_k}{\partial z_\alpha} \frac{\partial z_\alpha}{\partial x}.
\end{aligned} $$
<p>
In other words, these equations are <b>evaluated from top to the bottom,
row by row</b>.
</p>
</div>
</div>
<div id="outline-container-org006a24b" class="outline-3">
<h3 id="org006a24b">Reverse-mode AD</h3>
<div class="outline-text-3" id="text-org006a24b">
<p>
Reverse-mode AD differes from forward-mode AD by using different
auxiliary variables. In forward-mode AD, the auxiliary variables are
\(\partial z_k / \partial x\) (called <i>tangent</i> variables), and are evaluated from \(k=1\)
to \(k=N\). In reverse-mode AD, the auxiliary variables are \(\partial y / \partial
z_k\) (called <i>adjoint</i> variables), and are evaluated from \(k=N-1\) to
\(k=0\). For any \(0 \leq k \leq N-1\), we regard \(\mathcal{Z}_k := \{z_\alpha\}_{\alpha=0}^{k}\) as
independent variables and view \(\{z_\beta\}_{\beta=k+1}^N\) as functions of
\(\mathcal{Z}_k\). Thus, we can differentiate \[ y = y(z_0, z_1, \ldots, z_k) \]
w.r.t. \(z_k\) and obtain (see <a href="#orgd4be40f">the appendix</a> for an inductive proof)
</p>
\begin{equation}\tag{chain-rule: RAD}
\frac{\partial y}{\partial z_{k}} = \sum_{\beta=k+1}^N \frac{\partial y}{\partial z_\beta} \frac{\partial \phi_\beta}{\partial
z_k}, \quad k=N-1, N-2, \ldots, 0.
\end{equation}
<p>
The partial derivative \(\partial y/ \partial
z_k\) should be understood as the sensitivity of \(y\) w.r.t. \(z_k\). An
intuitive explanation of this formula is: <i>when \(z_k\) changes, the
change of the final output is determined by the cumulative effect of
changes in downstream variables</i> \(\{z_\beta\}_{\beta=k+1}^N\).
</p>

<p>
Starting from \(\partial y / \partial z_N = I\), we evaluate \(\partial y / \partial z_k\)
reversely.
</p>
$$ \begin{aligned}
\frac{\partial y}{\partial z_{N-1}} &= {\color{blue}\frac{\partial y}{\partial z_{N}} \frac{\partial \phi_N}{\partial z_{N-1}}}, \\
\frac{\partial y}{\partial z_{N-2}} &= {\color{blue} \frac{\partial y}{\partial z_{N}} \frac{\partial \phi_N}{\partial z_{N-2}}} + {\color{green} \frac{\partial y}{\partial z_{N-1}} \frac{\partial \phi_{N-1}}{\partial z_{N-2}}}, \\
\frac{\partial y}{\partial z_{N-3}} &= {\color{blue} \frac{\partial y}{\partial z_{N}} \frac{\partial \phi_N}{\partial z_{N-3}}} + {\color{green} \frac{\partial y}{\partial z_{N-1}} \frac{\partial \phi_{N-1}}{\partial z_{N-3}}} + \frac{\partial y}{\partial z_{N-2}} \frac{\partial \phi_{N-2}}{\partial z_{N-3}}, \\
&\cdots \\
\frac{\partial y}{\partial z_{0}} &= \sum_{\beta=1}^N \frac{\partial y}{\partial z_\beta} \frac{\partial \phi_\beta}{\partial z_k}.
\end{aligned} $$
<p>
Initially, all adjoint variables are set to 0 except \(\partial y/\partial z_N\),
which is set to \(I\).  First, we compute the blue terms \(\frac{\partial y}{\partial
z_N}\frac{\partial \phi_N}{\partial z_k}\) and add them to the corresponding adjoint
variable \(\partial y/\partial z_k\). In the next step, we compute the green terms
\(\frac{\partial y}{\partial z_{N-1}}\frac{\partial \phi_{N-1}}{\partial z_k}\) and add them to the
corresponding adjoint variable \(\partial y/\partial z_k\). Repeat this process until
all terms listed above have been calculated. Then, the accumulated
values in adjoint variables are theire true values.
</p>

<p>
In other words, these equations are <b>evaluated from left to right,
column by column</b>. After the evaluation of column \(\beta\), all adjoint
variables \(\partial y/ \partial z_k\) for \(k \geq \beta-1\) has been obtained.
</p>

<p>
It should be noted that the reverse calculations of \(\partial y/ \partial
z_k\) actually happens in the second phase of a two-phase process,
while intermediate variables \(z_k\) are calculated in the first
phase. This is different from forward-mode AD, where \(\partial z_k / \partial x\)
and \(z_k\) are calculated simultaneously and in a forward manner.
</p>
</div>
</div>
</div>
