2024-09-24-ImplementBP/notes.org
**  Examples: reverse-mode AD for scalar functions
<<sec:examples>>

Here we apply reverse-mode AD to scalar functions and demonstrate how
it works. We will discuss the case of vector functions in the
following sections.

Reverse-mode AD is inherently suitable for scalar output
$y$. Examining the formula (chain-rule: RAD), the Jacobian $\partial y / \partial
z_\beta$ now simplifies to row vectors as $y$ is one
dimensional. Consequently, all matrix multiplications $[\partial y/\partial z_\beta][\partial
\phi_\beta /\partial z_k]$ reduces to vector-matrix products.

For a variable $z$, we denote by a column vector $\dot{z} = [\partial y / \partial
z]^\intercal$. With this notation, the chain-rule of reverse-mode AD can be
written as $$ \dot{z}_k = \sum_{\beta=k+1}^N \biggl[ \frac{\partial \phi_\beta}{\partial z_k}
\biggr]^\intercal \dot{z}_\beta, \quad k=N-1, N-2, \ldots, 0.$$ Note that the true
gradient $\dot{z}_k$ is a summation accumulated from $\beta=N$ to
$\beta=k+1$. At each stage $\beta$, we can only compute a single term $[\partial \phi_\beta /\partial
z_k]^\intercal \dot{z}_\beta$ for $\dot{z}_k$.

In order to apply the chain rule, we record all the operations
$\{\phi_k\}$ along with their inputs and outputs on a /tape/ (alternatively
known as a /Wengert list/ or an /evaluation trace/).

/Example./ Consider the function $f(a, b) = \langle a, a+ b\rangle$.  The
computational graph is
| $k$ | input  | $\phi_k$           | output |
|-----+--------+-----------------+--------|
|   1 | $a, b$ | $z_1 = a+b$     | $z_1$  |
|   2 | $a, z_1$ | $z_2 = a^\intercal z_1$ | $z_2$  |

Initially, set $\dot{a}=0, \dot{b}=0$ and $\dot{z}_k = 0$.  Starting
at $\dot{z}_2 = [\partial y / \partial z_2]^\intercal = 1$, we then apply the chain rule to
propagate gradient reversely and accumulate the obtained value.
#+BEGIN_export HTML
$$ \begin{aligned}
(\text{Initialize}) &\qquad & \dot{z}_2 &\leftarrow 1 \\
(k=2) & \qquad &  \dot{a} &\leftarrow \dot{a} + \biggl[\frac{\partial \phi_k}{\partial a}\biggr]^\intercal \dot{z}_2 \\
& & \dot{z}_1 &\leftarrow \dot{z}_1 + \biggl[\frac{\partial \phi_k}{\partial z_1}\biggr]^\intercal  \dot{z}_2 \\
(k=1) & \qquad & \dot{a} &\leftarrow \dot{a} + \biggl[ \frac{\partial \phi_k}{\partial a} \biggr]^\intercal \dot{z}_1 \\
& & \dot{b} &\leftarrow \dot{b} +  \biggl[\frac{\partial \phi_k}{\partial b}\biggr]^\intercal \dot{z}_1\\
\end{aligned} $$
#+END_export
We can explicitly write down these values and verify.
#+BEGIN_export HTML
$$ \begin{aligned}
\dot{z}_2 &= 1 ,\\
\dot{z}_1 &= a ,\\
\dot{a} &=  z_1 \dot{z}_2 + \dot{z}_1 = 2a + b ,\\
\dot{b} &= \dot{z}_1 = a.
\end{aligned} $$
#+END_export

/Example./ Consider the function $f(a, b) = \|a\|^2 + a^\intercal b - \sin (a^\intercal
b)$. The computational graph is

| $k$ | input     | $\phi_k$             | output |
|-----+-----------+-------------------+--------|
|   1 | $a, b$    | $z_1 = a^\intercal b$     | $z_1$  |
|   2 | $a$       | $z_2 = a^\intercal a$     | $z_2$  |
|   3 | $z_1,z_2$ | $z_3 = z_1 + z_2$ | $z_3$  |
|   4 | $z_1$     | $z_4 = \sin z_1$  | $z_4$  |
|   5 | $z_3,z_4$ | $z_5=z_3-z_4$     | $z_5$  |

Initially, set $\dot{a}=0, \dot{b}=0$ and $\dot{z}_k = 0$.  Starting
at $\dot{z}_5 = [\partial y / \partial z_5]^\intercal = 1$, we then apply the chain rule to
propagate gradient reversely and accumulate the obtained value.
#+BEGIN_export HTML
$$ \begin{aligned}
(\text{Initialize}) &\qquad & \dot{z}_5 &\leftarrow 1 \\
(k=5) & \qquad &  \dot{z}_4 &\leftarrow \dot{z}_4 + \biggl[ \frac{\partial \phi_k}{\partial z_4}\biggr]^\intercal  \dot{z}_5 \\
& & \dot{z}_3 &\leftarrow \dot{z}_3 + \biggl[ \frac{\partial \phi_k}{\partial z_3}\biggr]^\intercal \dot{z}_5 \\
(k=4) & \qquad & \dot{z}_1 &\leftarrow \dot{z}_1 + \biggl[ \frac{\partial \phi_k}{\partial z_1}\biggr]^\intercal \dot{z}_4\\
(k=3) & \qquad & \dot{z}_2 &\leftarrow \dot{z}_2 + \biggl[ \frac{\partial \phi_k}{\partial z_2}\biggr]^\intercal \dot{z}_3\\
&  & \dot{z}_1 &\leftarrow \dot{z}_1 + \biggl[ \frac{\partial \phi_k}{\partial z_2}\biggr]^\intercal \dot{z}_3 \\
(k=2) & \qquad & \dot{a} &\leftarrow \dot{a} + \biggl[ \frac{\partial \phi_k}{\partial a}\biggr]^\intercal \dot{z}_2\\
(k=1) & \qquad & \dot{a} &\leftarrow \dot{a} + \biggl[ \frac{\partial \phi_k}{\partial a}\biggr]^\intercal \dot{z}_1\\
 &  & \dot{b} &\leftarrow \dot{b} + \biggl[ \frac{\partial \phi_k}{\partial b}\biggr]^\intercal \dot{z}_1\\
\end{aligned} $$
#+END_export
We can explicitly write down these values and verify.
#+BEGIN_export HTML
$$ \begin{aligned}
\dot{z}_5 &= 1 ,\\
\dot{z}_4 &= -\dot{z}_5 = -1 ,\\
\dot{z}_3 &= \dot{z}_5 = 1 ,\\
\dot{z}_2 &= \dot{z}_3 = 1 ,\\
\dot{z}_1 &= (\cos z_1) \dot{z}_4 + \dot{z}_3 = -\cos a^\intercal b + 1 ,\\
\dot{a} &= 2a \dot{z}_2 + b\dot{z}_1 = 2a + b(1 - \cos a^\intercal b) ,\\
\dot{b} &= a\dot{z}_1 = a(1 - \cos a^\intercal b).
\end{aligned} $$
#+END_export

