2024-09-24-ImplementBP/notes.org
** Jacobian-vector product

Examing the chain-rule formulae used in forward-mode and reverse-mode
AD, we note that it suffices to calculate the Jacobian $\partial \phi_k$. In
practice, however, we don't calculate Jacobian directly. Instead, we
calculate the so-called Jacobian-vector product (or vector-Jacobian
product).

Consider the function $y=f(x)$ and assume $x\in\mathbb{R}^n, y\in\mathbb{R}^m$.

For a vector $v\in\mathbb{R}^n$, forward-mode AD can efficiently calculate
the Jacobian-vector product $[\partial f]v$ by
\begin{equation}\tag{chain-rule: JVP}
\dot{z}_k = \sum_{\alpha=0}^{N-1} \biggl[\frac{\partial \phi_k}{\partial z_\alpha}\biggr] \dot{z}_\alpha, \quad
\text{ where }\dot{z}_\alpha := \biggl[\frac{\partial z_\alpha}{\partial x}\biggr] v.
\end{equation}

For a vector $v\in\mathbb{R}^m$, reverse-mode AD can efficiently calculate
the vector-Jacobian product $[\partial f]^\intercal v$ by
\begin{equation}\tag{chain-rule: VJP}
\dot{z}_k = \sum_{\beta=k+1}^N \biggl[\frac{\partial \phi_\beta}{\partial z_k}\biggr]^\intercal \dot{z}_\beta, \quad
\text{ where }\dot{z}_\beta := \biggl[ \frac{\partial y}{\partial z_\beta} \biggr]^\intercal v.
\end{equation}

There are two reasons why using Jacobian-vector product is always
better than using the Jacobian.

1. It requires less memory. Indeed, all calculations in (chain-rule:
   VJP) are matrix-vector product, while all calculations in
   (chain-rule: RAD) are matrix multiplications.

2. It remains efficient when parallized. If we want the full Jacobian
   matrix, we can run the algorithm with different $v_j=e_j$
   concurrently and then stack the result.

In deep learning, we use reverse-mode AD because the loss function is
a scalar function $$ \ell(\theta) = L(y, \hat{y}), \quad \text{ where }
y:=f(x;\theta). $$ The gradient is indeed a vector-Jacobian product $$ \frac{\partial
\ell(\theta)}{\partial \theta} = \frac{\partial L}{\partial y} \frac{\partial y}{\partial \theta}. $$

Finally, we should mention that in our formulation all vectors can
generalized to tensors. Indeed, for a tensor $x[\eta]$ of order $n$,
where $\eta \in \mathcal{I}(x) \subset \mathbb{N}^{n}$ is a multi-index, we can treat it as a vector
by iterating on $\mathcal{I}(x)$. Moreover, for a function $y=f(x)$ with $y$ a
tensor of order $m$, we can define the Jacobian-vector product by $$
\operatorname{JVP}_f(x, v)[\zeta] := \sum_{\eta \in \mathcal{I}(x)} \frac{\partial (f[\zeta])}{ \partial
(x[\eta])} v[\eta], \quad \zeta\in\mathcal{I}(y)\subset\mathbb{N}^m. $$ Similarly, the vector-Jacobian
product is defined by $$ \operatorname{VJP}_f(x, v)[\eta] := \sum_{\zeta \in \mathcal{I}(y)}
\frac{\partial (f[\zeta])}{ \partial (x[\eta])} v[\zeta], \quad \eta\in\mathcal{I}(x)\subset\mathbb{N}^n. $$ See
[[appendix:vjp-vjp-linear][the appendix]] for an example illustrating how we apply this definition
to matrix multiplication $f(A, B) = AB$.

** Implement forward-mode and reverse-mode AD
<<sec:implementation>>

In this section, we give the formal algorithm for differentiating a
function $y=f(x)$.

Let's begin with forward-mode AD, which evaluates the
Jacobian-vector product $[\partial f(x)]v$ at a given point $x$. Assume we
have access to the tape which records the sequence of elementary
operations and their inputs/output during the computation of the
target function $y=f(x)$. The tables in section [[sec:examples][Examples: reverse-mode
AD for scalar functions]] are examples of such tapes.

Forward-mode AD relies on the mathematical formula (chain-rule:
JVP). Starting with the gradient $v$ of the initial input $x$, we
traverse the tape in a forward direction, propagating gradients from
the inputs of $\phi_k$ to its output via its JVP. The pseudocode of
forward-mode AD can be summarized as follows.

#+BEGIN_SRC python
def forwardAD_along_tape(inputs, call_tape, inputs_v, *, gradkey):
    """Forward propagate gradient starting at inputs. Initially the grad of
    inputs is set to inputs_v.  `gradkey` is a string used for the dict key. For
    a given tensor `a`, the grad is stored in `a.buffer[gradkey]`"""
    for x, v in zip(inputs, inputs_v):
        x.buffer[gradkey] = v
    for k_inputs, k_outputs, k_phi, k_kwargs in call_tape:
        grad_inputs = [x.buffer[gradkey] for x in k_inputs]
        k_outputs.buffer[gradkey] = k_phi.jvp(
            k_inputs, k_outputs, grad_inputs, **k_kwargs
        )
#+END_SRC

Reverse-mode AD relies on the mathematical formula (chain-rule:
VJP). Starting with the gradient $v$ of the final output $y$, we
traverse the tape in a reverse direction, propagating gradients from
the output of $\phi_k$ to its inputs via its VJP. The pseudocode of
reverse-mode AD can be summarized as follows.

#+BEGIN_SRC python
def reverseAD_along_tape(y, call_tape, v, *, gradkey):
    """Backpropagate gradient starting at y. Initially the grad of y is set to
    v.  `gradkey` is a string used for the dict key. For a given tensor `a`, the
    grad is stored in `a.buffer[gradkey]`"""
    y.buffer[gradkey] = v
    for k_inputs, k_outputs, k_phi, k_kwargs in reversed(call_tape):
        grad_inputs = k_phi.vjp(
            k_inputs, k_outputs, k_outputs.buffer[gradkey], **k_kwargs
        )
        # accumulate grad
        for x, grad in zip(k_inputs, grad_inputs):
            x.buffer[gradkey] += grad
#+END_SRC

Comparing forward-mode AD and reverse-mode AD, a subtle difference is
the gradient accumulation process in the latter. In the formula
(chain-rule: JVP), the gradient $\dot{z}_k$ is obtained by a single
call of the JVP of $\phi_k$. Thus, in the algorithm, the value of
$\dot{z}_k$ is computed in a single step of the iteration.  In the
formula (chain-rule: VJP), however, the gradient $\dot{z}_k$ is
obtained by successive calls of the VJP of
$\{\phi_\beta\}_{\beta=k+1}^N$. Consequently, in the algorithm, the value of
$\dot{z}_k$ accumulates in several steps of the iteration.

See [[appendix:implementation][the appendix]] for an overview of my implementation in Python.

