2024-09-24-ImplementBP/notes.html
<div id="outline-container-org54bdb65" class="outline-2">
<h2 id="org54bdb65">Jacobian-vector product</h2>
<div class="outline-text-2" id="text-org54bdb65">
<p>
Examing the chain-rule formulae used in forward-mode and reverse-mode
AD, we note that it suffices to calculate the Jacobian \(\partial \phi_k\). In
practice, however, we don't calculate Jacobian directly. Instead, we
calculate the so-called Jacobian-vector product (or vector-Jacobian
product).
</p>

<p>
Consider the function \(y=f(x)\) and assume \(x\in\mathbb{R}^n, y\in\mathbb{R}^m\).
</p>

<p>
For a vector \(v\in\mathbb{R}^n\), forward-mode AD can efficiently calculate
the Jacobian-vector product \([\partial f]v\) by
</p>
\begin{equation}\tag{chain-rule: JVP}
\dot{z}_k = \sum_{\alpha=0}^{N-1} \biggl[\frac{\partial \phi_k}{\partial z_\alpha}\biggr] \dot{z}_\alpha, \quad
\text{ where }\dot{z}_\alpha := \biggl[\frac{\partial z_\alpha}{\partial x}\biggr] v.
\end{equation}

<p>
For a vector \(v\in\mathbb{R}^m\), reverse-mode AD can efficiently calculate
the vector-Jacobian product \([\partial f]^\intercal v\) by
</p>
\begin{equation}\tag{chain-rule: VJP}
\dot{z}_k = \sum_{\beta=k+1}^N \biggl[\frac{\partial \phi_\beta}{\partial z_k}\biggr]^\intercal \dot{z}_\beta, \quad
\text{ where }\dot{z}_\beta := \biggl[ \frac{\partial y}{\partial z_\beta} \biggr]^\intercal v.
\end{equation}

<p>
There are two reasons why using Jacobian-vector product is always
better than using the Jacobian.
</p>

<ol class="org-ol">
<li>It requires less memory. Indeed, all calculations in (chain-rule:
VJP) are matrix-vector product, while all calculations in
(chain-rule: RAD) are matrix multiplications.</li>

<li>It remains efficient when parallized. If we want the full Jacobian
matrix, we can run the algorithm with different \(v_j=e_j\)
concurrently and then stack the result.</li>
</ol>

<p>
In deep learning, we use reverse-mode AD because the loss function is
a scalar function \[ \ell(\theta) = L(y, \hat{y}), \quad \text{ where }
y:=f(x;\theta). \] The gradient is indeed a vector-Jacobian product \[ \frac{\partial
\ell(\theta)}{\partial \theta} = \frac{\partial L}{\partial y} \frac{\partial y}{\partial \theta}. \]
</p>

<p>
Finally, we should mention that in our formulation all vectors can
generalized to tensors. Indeed, for a tensor \(x[\eta]\) of order \(n\),
where \(\eta \in \mathcal{I}(x) \subset \mathbb{N}^{n}\) is a multi-index, we can treat it as a vector
by iterating on \(\mathcal{I}(x)\). Moreover, for a function \(y=f(x)\) with \(y\) a
tensor of order \(m\), we can define the Jacobian-vector product by \[
\operatorname{JVP}_f(x, v)[\zeta] := \sum_{\eta \in \mathcal{I}(x)} \frac{\partial (f[\zeta])}{ \partial
(x[\eta])} v[\eta], \quad \zeta\in\mathcal{I}(y)\subset\mathbb{N}^m. \] Similarly, the vector-Jacobian
product is defined by \[ \operatorname{VJP}_f(x, v)[\eta] := \sum_{\zeta \in \mathcal{I}(y)}
\frac{\partial (f[\zeta])}{ \partial (x[\eta])} v[\zeta], \quad \eta\in\mathcal{I}(x)\subset\mathbb{N}^n. \] See
<a href="#org3190f16">the appendix</a> for an example illustrating how we apply this definition
to matrix multiplication \(f(A, B) = AB\).
</p>
</div>
</div>
<div id="outline-container-org4d46603" class="outline-2">
<h2 id="org4d46603">Implement forward-mode and reverse-mode AD</h2>
<div class="outline-text-2" id="text-org4d46603">
<p>
<a id="org880a6fd"></a>
</p>

<p>
In this section, we give the formal algorithm for differentiating a
function \(y=f(x)\).
</p>

<p>
Let's begin with forward-mode AD, which evaluates the
Jacobian-vector product \([\partial f(x)]v\) at a given point \(x\). Assume we
have access to the tape which records the sequence of elementary
operations and their inputs/output during the computation of the
target function \(y=f(x)\). The tables in section <a href="#org60a8cec">Examples: reverse-mode
AD for scalar functions</a> are examples of such tapes.
</p>

<p>
Forward-mode AD relies on the mathematical formula (chain-rule:
JVP). Starting with the gradient \(v\) of the initial input \(x\), we
traverse the tape in a forward direction, propagating gradients from
the inputs of \(\phi_k\) to its output via its JVP. The pseudocode of
forward-mode AD can be summarized as follows.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">forwardAD_along_tape</span>(inputs, call_tape, inputs_v, *, gradkey):
    <span style="color: #2aa198;">"""Forward propagate gradient starting at inputs. Initially the grad of</span>
<span style="color: #2aa198;">    inputs is set to inputs_v.  `gradkey` is a string used for the dict key. For</span>
<span style="color: #2aa198;">    a given tensor `a`, the grad is stored in `a.buffer[gradkey]`"""</span>
    <span style="color: #859900; font-weight: bold;">for</span> x, v <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">zip</span>(inputs, inputs_v):
        x.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey] = v
    <span style="color: #859900; font-weight: bold;">for</span> k_inputs, k_outputs, k_phi, k_kwargs <span style="color: #859900; font-weight: bold;">in</span> call_tape:
        <span style="color: #268bd2;">grad_inputs</span> = [x.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey] <span style="color: #859900; font-weight: bold;">for</span> x <span style="color: #859900; font-weight: bold;">in</span> k_inputs]
        k_outputs.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey] = k_phi.jvp(
            k_inputs, k_outputs, grad_inputs, **k_kwargs
        )
</pre>
</div>

<p>
Reverse-mode AD relies on the mathematical formula (chain-rule:
VJP). Starting with the gradient \(v\) of the final output \(y\), we
traverse the tape in a reverse direction, propagating gradients from
the output of \(\phi_k\) to its inputs via its VJP. The pseudocode of
reverse-mode AD can be summarized as follows.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">reverseAD_along_tape</span>(y, call_tape, v, *, gradkey):
    <span style="color: #2aa198;">"""Backpropagate gradient starting at y. Initially the grad of y is set to</span>
<span style="color: #2aa198;">    v.  `gradkey` is a string used for the dict key. For a given tensor `a`, the</span>
<span style="color: #2aa198;">    grad is stored in `a.buffer[gradkey]`"""</span>
    y.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey] = v
    <span style="color: #859900; font-weight: bold;">for</span> k_inputs, k_outputs, k_phi, k_kwargs <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">reversed</span>(call_tape):
        <span style="color: #268bd2;">grad_inputs</span> = k_phi.vjp(
            k_inputs, k_outputs, k_outputs.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey], **k_kwargs
        )
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">accumulate grad</span>
        <span style="color: #859900; font-weight: bold;">for</span> x, grad <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">zip</span>(k_inputs, grad_inputs):
            x.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey] += grad
</pre>
</div>

<p>
Comparing forward-mode AD and reverse-mode AD, a subtle difference is
the gradient accumulation process in the latter. In the formula
(chain-rule: JVP), the gradient \(\dot{z}_k\) is obtained by a single
call of the JVP of \(\phi_k\). Thus, in the algorithm, the value of
\(\dot{z}_k\) is computed in a single step of the iteration.  In the
formula (chain-rule: VJP), however, the gradient \(\dot{z}_k\) is
obtained by successive calls of the VJP of
\(\{\phi_\beta\}_{\beta=k+1}^N\). Consequently, in the algorithm, the value of
\(\dot{z}_k\) accumulates in several steps of the iteration.
</p>

<p>
See <a href="#orgb898803">the appendix</a> for an overview of my implementation in Python.
</p>
</div>
</div>
