2024-09-24-ImplementBP/notes.org
** Hessian-vector product

The Hessian matrix of a /scalar/ function $f$ can be defined by the
Jacobian matrix of $\partial f$, $$ (\partial^2 f)_{i,j} := (\partial(\partial f))_{i,j} =
\frac{\partial}{\partial x_j}(\partial f)_i = \frac{\partial}{\partial x_j} \frac{\partial}{\partial x_i} f. $$ Let
$g(x)=\partial f(x)$. Calculating the Jacobian-vector product $[\partial g]v$ is
essentially calculating the Hessian-vector product $[\partial^2 f]v$. This
can be achieved by a combination of forward-mode AD and
reverse-mode AD.

Given the input $x$, first calculate $y=f(x)$ and record the
 operations /during this procedure/ in a tape $T_1$. Then, /take a new
 tape/ $T_2$. Use $T_2$ to record the operations of applying
 forward-mode AD on $T_1$ to calculate the Jacobian-vector product
 $L=[\partial f]v$, which is a scalar in this case. Finally, apply
 reverse-mode AD on $T_1 \cup T_2$ to obtain gradient $\partial L = \partial([\partial f]v) =
 v^\intercal [\partial^2 f]$. This is exactly the Hessian-vector product $[\partial^2f]v$ if
 the Hessian matrix is symmetric.

#+BEGIN_SRC python
def hvp_by_reverse_forwardAD(f, inputs, v_vars, *, inputs_vars):
    """Calculate the Hessian-vector product of function `f` using
    reverse-on-forward mode automatic differentiation.

    `inputs_vars` is an subset of `inputs` specifying independent
    variables in the Hessian matrix.  `inputs_vars` aligns with the
    number of tensors in `v_vars`.
    """
    tape1 = []
    with my_func_tracker.track_func(True, tape=tape1):
        y = f(*inputs)  # do computations and track in tape1

    tape2 = []
    with my_func_tracker.track_func(True, tape=tape2):
        forwardAD_along_tape(inputs_vars, tape1, v_vars, gradkey="rfgrad1")
        yy = y.buffer["rfgrad1"]

    # apply reverse-mode AD to yy
    # ATTENTION: we have to use a different gradkey to avoid modifying inputs
    #            recorded in tape 2
    reverseAD_along_tape(yy, tape1 + tape2, MyTensor(1.0), gradkey="rfgrad2")
    return [x.buffer["rfgrad2"] for x in inputs_vars]
#+END_SRC

The above procedure is the reverse-on-forward mode AD for calculating the
Hessian-vector product. There are, of course, other procedures to
obtain the same result.

1. /Forward-on-reverse mode AD./ After recording the operations of
   $y=f(x)$ in a tape $T_1$, use a new tape $T_2$ to record the
   operations of applying reverse-mode AD on $T_1$ to calculate
   the gradient $\partial f(x)$. Then, apply forward-mode AD on $T_1 \cup
   T_2$ to calculate the Jacobian-vector product $[\partial (\partial f)]v$, which
   is exactly the Hessian-vector product $[\partial^2f]v$.

2. /Reverse-on-reverse mode AD/. After recording the operations of
   $y=f(x)$ in a tape $T_1$, use a new tape $T_2$ to record the
   operations of 1) applying reverse-mode AD on $T_1$ to calculate
   the gradient $\partial f(x)$ (which is a row vector in our notation); 2)
   computing the Jacobian-vector product of $L=[\partial f(x)]v$. Then, apply
   reverse-mode AD on $T_1 \cup T_2$ to calculate the gradient $\partial L =
   \partial([\partial f]v)=v^\intercal [\partial^2f]$. This is exactly the Hessian-vector product
   $[\partial^2f]v$ if the Hessian matrix is symmetric.

See [[appendix:implementation][the appendix]] for an overview of my implementation in Python.

** Conclusion

AD refers to a general technique that generates numerical derivative
evaluations rather than derivative expressions. Backpropagation is a
special case of AD that runs in reverse mode. Besides reverse-mode AD,
there are forward-mode AD and even reverse-on-forward AD.

For a function $y=f(x)$ with $x\in\mathbb{R}^n$ and $y\in\mathbb{R}^m$, forward-mode AD can
efficiently compute the Jacobian-vector product $[\partial f]v$ for any given
initial gradient $v\in\mathbb{R}^n$, while reverse-mode AD can efficiently
compute the vector-Jacobian product $v^\intercal [\partial f]$ for any given terminal
gradient $v\in\mathbb{R}^m$. Deep learning uses reverse-mode AD because loss
functions are scalar functions, which means $m=1$ and setting $v=1$
yields the gradient $\partial f$ directly.

For a scalar function $y=f(x)$, combining forward-mode AD and
reverse-mode AD can efficiently evaluate the Hessian-vector product
$[\partial^2 f]v$ for any vector $v$.

** References

Books and Papers

- Bishop, C. M., & Bishop, H. (2024). Deep learning: Foundations and concepts. Springer.
- Zhang, A., Lipton, Z. C., Li, M., & Smola, A. J. (2023). Dive into Deep Learning. Cambridge University Press. https://d2l.ai
- Baydin, A. G., Pearlmutter, B. A., Radul, A. A., & Siskind, J. M. (2018). Automatic differentiation in machine learning: A survey. Journal of Machine Learning Research, 18(153), 1–43.
- Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., & Lerer, A. (2017). Automatic differentiation in PyTorch. Neural Information Processing Systems. https://openreview.net/forum?id=BJJsrmfCZ

Online resources

- Holmes, A. (2024). What's Automatic Differentiation? Hugging Face. https://huggingface.co/blog/andmholm/what-is-automatic-differentiation
- Lashoun (2020). Crash Course on PyTorch and Autograd. https://lashoun.com/science/crash-course-on-pytorch-and-autograd/
- Wang, J. (2021). Understanding pytorch’s autograd with =grad_fn= and =next_functions= https://amsword.medium.com/understanding-pytorchs-autograd-with-grad-fn-and-next-functions-b2c4836daa00
- Simple Grad. [Example implementation of reverse-mode autodiff].  https://colab.research.google.com/drive/1VpeE6UvEPRz9HmsHh1KS0XxXjYu533EC
- PyTorch. Automatic Differentiation with torch.autograd. https://pytorch.org/tutorials/beginner/basics/autogradqs_tutorial.html
- PyTorch. Jacobians, Hessians, hvp, vhp, and more: composing function
  transforms. https://pytorch.org/tutorials/intermediate/jacobians_hessians.html

