2024-09-24-ImplementBP/notes.html
<div id="outline-container-orgf719635" class="outline-2">
<h2 id="orgf719635">Hessian-vector product</h2>
<div class="outline-text-2" id="text-orgf719635">
<p>
The Hessian matrix of a <i>scalar</i> function \(f\) can be defined by the
Jacobian matrix of \(\partial f\), \[ (\partial^2 f)_{i,j} := (\partial(\partial f))_{i,j} =
\frac{\partial}{\partial x_j}(\partial f)_i = \frac{\partial}{\partial x_j} \frac{\partial}{\partial x_i} f. \] Let
\(g(x)=\partial f(x)\). Calculating the Jacobian-vector product \([\partial g]v\) is
essentially calculating the Hessian-vector product \([\partial^2 f]v\). This
can be achieved by a combination of forward-mode AD and
reverse-mode AD.
</p>

<p>
Given the input \(x\), first calculate \(y=f(x)\) and record the
 operations <i>during this procedure</i> in a tape \(T_1\). Then, <i>take a new
 tape</i> \(T_2\). Use \(T_2\) to record the operations of applying
 forward-mode AD on \(T_1\) to calculate the Jacobian-vector product
 \(L=[\partial f]v\), which is a scalar in this case. Finally, apply
 reverse-mode AD on \(T_1 \cup T_2\) to obtain gradient \(\partial L = \partial([\partial f]v) =
 v^\intercal [\partial^2 f]\). This is exactly the Hessian-vector product \([\partial^2f]v\) if
 the Hessian matrix is symmetric.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">hvp_by_reverse_forwardAD</span>(f, inputs, v_vars, *, inputs_vars):
    <span style="color: #2aa198;">"""Calculate the Hessian-vector product of function `f` using</span>
<span style="color: #2aa198;">    reverse-on-forward mode automatic differentiation.</span>

<span style="color: #2aa198;">    `inputs_vars` is an subset of `inputs` specifying independent</span>
<span style="color: #2aa198;">    variables in the Hessian matrix.  `inputs_vars` aligns with the</span>
<span style="color: #2aa198;">    number of tensors in `v_vars`.</span>
<span style="color: #2aa198;">    """</span>
    <span style="color: #268bd2;">tape1</span> = []
    <span style="color: #859900; font-weight: bold;">with</span> my_func_tracker.track_func(<span style="color: #268bd2; font-weight: bold;">True</span>, tape=tape1):
        <span style="color: #268bd2;">y</span> = f(*inputs)  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">do computations and track in tape1</span>

    <span style="color: #268bd2;">tape2</span> = []
    <span style="color: #859900; font-weight: bold;">with</span> my_func_tracker.track_func(<span style="color: #268bd2; font-weight: bold;">True</span>, tape=tape2):
        forwardAD_along_tape(inputs_vars, tape1, v_vars, gradkey=<span style="color: #2aa198;">"rfgrad1"</span>)
        <span style="color: #268bd2;">yy</span> = y.<span style="color: #657b83; font-weight: bold;">buffer</span>[<span style="color: #2aa198;">"rfgrad1"</span>]

    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">apply reverse-mode AD to yy</span>
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">ATTENTION: we have to use a different gradkey to avoid modifying inputs</span>
    <span style="color: #93a1a1;">#            </span><span style="color: #93a1a1;">recorded in tape 2</span>
    reverseAD_along_tape(yy, tape1 + tape2, MyTensor(1.0), gradkey=<span style="color: #2aa198;">"rfgrad2"</span>)
    <span style="color: #859900; font-weight: bold;">return</span> [x.<span style="color: #657b83; font-weight: bold;">buffer</span>[<span style="color: #2aa198;">"rfgrad2"</span>] <span style="color: #859900; font-weight: bold;">for</span> x <span style="color: #859900; font-weight: bold;">in</span> inputs_vars]
</pre>
</div>

<p>
The above procedure is the reverse-on-forward mode AD for calculating the
Hessian-vector product. There are, of course, other procedures to
obtain the same result.
</p>

<ol class="org-ol">
<li><i>Forward-on-reverse mode AD.</i> After recording the operations of
\(y=f(x)\) in a tape \(T_1\), use a new tape \(T_2\) to record the
operations of applying reverse-mode AD on \(T_1\) to calculate
the gradient \(\partial f(x)\). Then, apply forward-mode AD on \(T_1 \cup
   T_2\) to calculate the Jacobian-vector product \([\partial (\partial f)]v\), which
is exactly the Hessian-vector product \([\partial^2f]v\).</li>

<li><i>Reverse-on-reverse mode AD</i>. After recording the operations of
\(y=f(x)\) in a tape \(T_1\), use a new tape \(T_2\) to record the
operations of 1) applying reverse-mode AD on \(T_1\) to calculate
the gradient \(\partial f(x)\) (which is a row vector in our notation); 2)
computing the Jacobian-vector product of \(L=[\partial f(x)]v\). Then, apply
reverse-mode AD on \(T_1 \cup T_2\) to calculate the gradient \(\partial L =
   \partial([\partial f]v)=v^\intercal [\partial^2f]\). This is exactly the Hessian-vector product
\([\partial^2f]v\) if the Hessian matrix is symmetric.</li>
</ol>

<p>
See <a href="#orgb898803">the appendix</a> for an overview of my implementation in Python.
</p>
</div>
</div>
<div id="outline-container-orgdac8ba1" class="outline-2">
<h2 id="orgdac8ba1">Conclusion</h2>
<div class="outline-text-2" id="text-orgdac8ba1">
<p>
AD refers to a general technique that generates numerical derivative
evaluations rather than derivative expressions. Backpropagation is a
special case of AD that runs in reverse mode. Besides reverse-mode AD,
there are forward-mode AD and even reverse-on-forward AD.
</p>

<p>
For a function \(y=f(x)\) with \(x\in\mathbb{R}^n\) and \(y\in\mathbb{R}^m\), forward-mode AD can
efficiently compute the Jacobian-vector product \([\partial f]v\) for any given
initial gradient \(v\in\mathbb{R}^n\), while reverse-mode AD can efficiently
compute the vector-Jacobian product \(v^\intercal [\partial f]\) for any given terminal
gradient \(v\in\mathbb{R}^m\). Deep learning uses reverse-mode AD because loss
functions are scalar functions, which means \(m=1\) and setting \(v=1\)
yields the gradient \(\partial f\) directly.
</p>

<p>
For a scalar function \(y=f(x)\), combining forward-mode AD and
reverse-mode AD can efficiently evaluate the Hessian-vector product
\([\partial^2 f]v\) for any vector \(v\).
</p>
</div>
</div>
<div id="outline-container-orgcd67d14" class="outline-2">
<h2 id="orgcd67d14">References</h2>
<div class="outline-text-2" id="text-orgcd67d14">
<p>
Books and Papers
</p>

<ul class="org-ul">
<li>Bishop, C. M., &amp; Bishop, H. (2024). Deep learning: Foundations and concepts. Springer.</li>
<li>Zhang, A., Lipton, Z. C., Li, M., &amp; Smola, A. J. (2023). Dive into Deep Learning. Cambridge University Press. <a href="https://d2l.ai">https://d2l.ai</a></li>
<li>Baydin, A. G., Pearlmutter, B. A., Radul, A. A., &amp; Siskind, J. M. (2018). Automatic differentiation in machine learning: A survey. Journal of Machine Learning Research, 18(153), 1–43.</li>
<li>Paszke, A., Gross, S., Chintala, S., Chanan, G., Yang, E., DeVito, Z., Lin, Z., Desmaison, A., Antiga, L., &amp; Lerer, A. (2017). Automatic differentiation in PyTorch. Neural Information Processing Systems. <a href="https://openreview.net/forum?id=BJJsrmfCZ">https://openreview.net/forum?id=BJJsrmfCZ</a></li>
</ul>

<p>
Online resources
</p>

<ul class="org-ul">
<li>Holmes, A. (2024). What's Automatic Differentiation? Hugging Face. <a href="https://huggingface.co/blog/andmholm/what-is-automatic-differentiation">https://huggingface.co/blog/andmholm/what-is-automatic-differentiation</a></li>
<li>Lashoun (2020). Crash Course on PyTorch and Autograd. <a href="https://lashoun.com/science/crash-course-on-pytorch-and-autograd/">https://lashoun.com/science/crash-course-on-pytorch-and-autograd/</a></li>
<li>Wang, J. (2021). Understanding pytorch’s autograd with <code>grad_fn</code> and <code>next_functions</code> <a href="https://amsword.medium.com/understanding-pytorchs-autograd-with-grad-fn-and-next-functions-b2c4836daa00">https://amsword.medium.com/understanding-pytorchs-autograd-with-grad-fn-and-next-functions-b2c4836daa00</a></li>
<li>Simple Grad. [Example implementation of reverse-mode autodiff].  <a href="https://colab.research.google.com/drive/1VpeE6UvEPRz9HmsHh1KS0XxXjYu533EC">https://colab.research.google.com/drive/1VpeE6UvEPRz9HmsHh1KS0XxXjYu533EC</a></li>
<li>PyTorch. Automatic Differentiation with torch.autograd. <a href="https://pytorch.org/tutorials/beginner/basics/autogradqs_tutorial.html">https://pytorch.org/tutorials/beginner/basics/autogradqs_tutorial.html</a></li>
<li>PyTorch. Jacobians, Hessians, hvp, vhp, and more: composing function
transforms. <a href="https://pytorch.org/tutorials/intermediate/jacobians_hessians.html">https://pytorch.org/tutorials/intermediate/jacobians_hessians.html</a></li>
</ul>
</div>
</div>
