2024-09-24-ImplementBP/notes.html
<div id="outline-container-org54ca842" class="outline-2">
<h2 id="org54ca842">Appendix: An inductive proof of reverse-mode AD formula</h2>
<div class="outline-text-2" id="text-org54ca842">
<p>
<a id="orgd4be40f"></a>
</p>

<p>
Consider the following computational graph
</p>
$$ \begin{aligned}
z_0 &= x, \\
z_k &= \phi_k(z_0, z_1, \ldots, z_{k-1}), \quad k=1, 2, \ldots, N, \\
y &= z_N.
\end{aligned} $$

<p>
Define functions \(\{f_k\}\) inductively from \(k=N\) to \(k=1\).
</p>

<ol class="org-ol">
<li>For \(k=N\), \(f_N:= \phi_N\).</li>

<li>Assume \(f_{k+1}\) has been defined. Then, \(f_k\) is defined by the
map \[ (z_0, z_1, \ldots, z_{k-1}) \mapsto f_{k+1}(z_0, z_1, \ldots,
   z_{k-1}, \phi_k(z_0, z_1, \ldots, z_{k-1})). \]</li>
</ol>

<p>
We prove by induction that for any \(1 \leq k \leq N-1\), \[ \frac{\partial
f_{k+1}}{\partial z_s} = \frac{\partial \phi_N}{\partial z_s} + \sum_{\beta=k+1}^{N-1} \frac{\partial
f_{\beta+1}}{\partial z_\beta}\frac{\partial \phi_\beta}{\partial z_s}, \quad 0 \leq s \leq k-1. \]
</p>

<ol class="org-ol">
<li>For \(k=N-1\), \(f_{k+1} = f_N = \phi_N\). The statement holds.</li>

<li>Assume the statement holds for function \(f_{k+1}\). We want to prove
that it holds for \(f_k\) too. According to the definition, \[
   f_k(z_0, z_1, \ldots, z_{k-1}) = f_{k+1}(z_0, z_1, \ldots, z_{k-1},
   \phi_k(z_0, z_1, \ldots, z_{k-1})). \] For any \(0 \leq s \leq k-1\), we
differentiate both sides of the equation w.r.t. \(z_s\) and obtain \[
   \frac{\partial f_k}{\partial z_s} = \frac{\partial f_{k+1}}{\partial z_s} + \frac{\partial f_{k+1}}{\partial
   z_k} \frac{\partial \phi_k}{z_s}. \] Substituting the hypothesis yields \[
   \frac{\partial f_k}{\partial z_s} = \frac{\partial \phi_N}{\partial z_s} + \sum_{\beta=k+1}^{N-1} \frac{\partial
   f_{\beta+1}}{\partial z_\beta}\frac{\partial \phi_\beta}{\partial z_s} + \frac{\partial f_{k+1}}{\partial z_k}
   \frac{\partial \phi_k}{z_s}. \] This shows that the statement holds for
\(f_k\).</li>

<li>By induction, the statement holds for any \(1 \leq k \leq N-1\).</li>
</ol>

<p>
The adjoint variables \(\partial y / \partial z_k\) is then formally defined by \(\partial
f_{k+1} / \partial z_k\). Moreover, \(\partial y / \partial z_N\) is defined by the identity
matrix.  Setting \(s=k-1\) in the statement yields \[ \frac{\partial y}{\partial z_k}
= \frac{\partial \phi_N}{\partial z_k} + \sum_{\beta=k+1}^{N-1} \frac{\partial y}{\partial z_\beta}\frac{\partial
\phi_\beta}{\partial z_k}.  \] This is exactly the formula uesd in reverse-mode AD.
</p>
</div>
</div>
<div id="outline-container-org4876bdc" class="outline-2">
<h2 id="org4876bdc">Appendix: JVP and VJP for linear maps</h2>
<div class="outline-text-2" id="text-org4876bdc">
<p>
<a id="org3190f16"></a>
</p>

<p>
Let \(y=f(A, B) = AB\) where \(A\) and \(B\) are two matrices. The output
\(y\) is also a matrix and \(y[i,k] = \sum_j A[i,j]B[j,k]\).
</p>

<p>
For a matrix \(v\) with the same shape as \(A\), \[
\operatorname{JVP}_f(A, v)[i,k] = \sum_{i',j} \frac{\partial y[i,k]}{\partial
A[i',j]}v[i',j] = \sum_j B[j, k]v[i, j] = vB. \]
</p>

<p>
For a matrix \(v\) with the same shape as \(B\), \[
\operatorname{JVP}_f(B, v)[i,k] = \sum_{j, k'} \frac{\partial y[i,k]}{\partial
B[j, k']}v[j, k'] = \sum_j A[i, j]v[j, k] = Av. \]
</p>

<p>
For a matrix \(v\) with the same shape as \(y\),  \[
\operatorname{VJP}_f(A, v)[i,j] = \sum_{i', k} \frac{\partial y[i',k]}{\partial
A[i, j]}v[i', k] = \sum_k B[j, k]v[i, k] = vB^\intercal. \]
</p>

<p>
For a matrix \(v\) with the same shape as \(y\),  \[
\operatorname{VJP}_f(B, v)[j, k] = \sum_{i, k'} \frac{\partial y[i,k']}{\partial
B[j, k]}v[i, k'] = \sum_i A[i, j]v[i, k] = A^\intercal v. \]
</p>
</div>
</div>
