2024-09-24-ImplementBP/notes.org
** Appendix: Overview of the Python Implementation
<<appendix:implementation>>

The complete code is available at [[https://github.com/Dou-Meishi/audi][this github repo]].  The overall
framework follows [[https://colab.research.google.com/drive/1VpeE6UvEPRz9HmsHh1KS0XxXjYu533EC][this colab notebook]].  Basically, I implement the
following data structures.

1. =MyFunction=. This models the elementary operations, such as addition,
  multiplication, division, subtraction, matrix multiplication and so
  on.  Instances of this class have attributes =vjp= and =jvp=, which are
  responsible for computing vector-Jacobian products and
  Jacobian-vector products.

  #+BEGIN_SRC python
class MyFunction(object):
    """Functions with vjp and jvp as attributes."""

    def __init__(self, name, func, func_vjp=None, func_jvp=None):
        self.name = name
        self.func = func
        self.vjp = func_vjp
        self.jvp = func_jvp

    def __call__(self, *args, **kws):
        return self.func(*args, **kws)
  #+END_SRC

2. =MyFunctionTracker=. This is a decorator class to track inputs and
   outputs of elementary operations, designed for the class
   =MyFunction=.  The global instance =my_func_tracker= decorates the
   =MyFunction.__call__= method. By doing so, each call of the
   elementary operations will be recorded in
   =my_func_tracker.call_tape=. Moreover, the method =track_func= returns
   a context manager for conveniently toggling traking functionality.

   #+BEGIN_SRC python
class MyFuncTracker(object):
    """A decorator class to track function inputs and outputs.
    Designed for MyFunction class.

    Store recorded calls in attribute `call_tape`, a list of tuples
    representing (inputs_k, outputs_k, func_k).

    Args:
        do_track (bool): A boolean flag to determine whether tracking is enabled.
    """

    def __init__(self, do_track: bool):
        self.do_track = do_track
        self.call_tape = []

    def __call__(self, func):
        """Wrap the function to track inputs and outputs in `self.call_tape`.
        Expect func receive self as its first argument."""
        pass

    @contextmanager
    def track_func(self, do_track: bool, tape: Union[None, list] = None):
        """Context manager to enable or disable tracking within a block.  If
        tape is not None, store records in it. Otherwise, store records in
        `self.call_tape`."""
        pass

# initialize a global function tracker
my_func_tracker = MyFuncTracker(do_track=True)
# apply it to MyFunction class
MyFunction.__call__ = my_func_tracker(MyFunction.__call__)
   #+END_SRC

3. =MyTensor=. This models the variables for inputs and outputs of
   elementary operations. Instances of this class comprise, =value= for
   a NumPy array and =buffer= for a dictionary. Arithmetic operators of
   this class are overloaded by =MyFunction= instances following the
   instructions mentioned in the Python documentation [[https://docs.python.org/3/reference/datamodel.html#emulating-numeric-types][Emulating
   numeric types]].  By doing so, calculations involving =MyTensor=
   instances will be recorded by =my_func_tracker= automatically.

   #+BEGIN_SRC python
class MyTensor(object):
    def __init__(self, value=0):
        self.value = np.asarray(value)
        self.buffer = defaultdict(self.default_grad)

    def default_grad(self):
        return MyTensor(np.zeros_like(self.value))

    def __add__(self, other):
        pass
   #+END_SRC

There are two notable things when implementing these classes.

1. The attributes =vjp= and =jvp= of =MyFunction= instances are
   functions. These functions accepts =MyTensor= inputs and return
   =MyTensor= outputs, utilizing operations exclusively modelded by
   =MyFunction= for tensor manipulation. Therefore, calculations
   performed by =vjp= and =jvp= can be tracked by =my_func_tracker=, a
   crucial aspect for computing high-order derivatives. Below is the
   definition of addition along with its respective JVP/VJP
   functionalities. Notably, the JVP propagates gradients of inputs to
   gradient of outputs, while the VJP propagates gradient of outputs
   to gradient of inputs.

   #+BEGIN_SRC python
def _add(a: MyTensor, b: MyTensor) -> MyTensor:
    return MyTensor(a.value + b.value)


def _add_vjp(
    inputs: list[MyTensor], outputs: MyTensor, grad_outputs: MyTensor
) -> list[MyTensor]:
    return (grad_outputs for _ in inputs)


def _add_jvp(
    inputs: list[MyTensor], outputs: MyTensor, grad_inputs: list[MyTensor]
) -> MyTensor:
    return grad_inputs[0] + grad_inputs[1]


add = MyFunction("Add", _add, func_vjp=_add_vjp, func_jvp=_add_jvp)
   #+END_SRC

2. Broadcast operations should be tracked too. As NumPy arrays can
   broadcast their shape automatically, the function =_add= mentioned
   earlier may receive a vector $x\in\mathbb{R}^3$ and a scalar $k\in\mathbb{R}$ and return
   a new vector $y=x+k\mathbb{1}$. Indeed, there is a broadcast operation $k \mapsto
   k\mathbb{1}\in\mathbb{R}^3$ besides addition. Failing to record these broadcast
   operations the gradient can lead to incorrect gradient
   calculations. Below are the definitions of broadcast and addition
   operations in =MyTensor=.

   #+BEGIN_SRC python
class MyTensor(object):

    def __add__(self, other):
        if not isinstance(other, MyTensor):
            other = MyTensor(other)
        a, b = MyTensor.broadcast(self, other)
        return add(a, b)

    @staticmethod
    def broadcast(*tensors):
        shape = np.broadcast_shapes(*[t.shape for t in tensors])
        return tuple(t.expand(shape=shape) for t in tensors)

def _expand(a: MyTensor, *, shape: list[int]) -> MyTensor:
    return MyTensor(np.broadcast_to(a.value, shape))

expand = MyFunction("Expand", _expand, func_vjp=_expand_vjp, func_jvp=_expand_jvp)
   #+END_SRC

Finally, forward-mode AD and reverse-mode AD can be implemented as
follows.

#+BEGIN_SRC python
def forwardAD(
    f: Callable[[list[MyTensor]], MyTensor],
    inputs: list[MyTensor],
    inputs_v: list[MyTensor],
    *,
    gradkey: str = "grad",
) -> MyTensor:
    """Use forward-mode AD to compute the Jacobian-vector product of f.
    Return the gradient of f(dot(v, x)) evaluated at inputs.

    Args
    ----
    - `f`: The function to be differentiated.

    - `inputs`: Inputs of `f`.

    - `inputs_v`: A list of tensor matches `inputs`.

    - `gradkey`: A string used for the dict key. For a given tensor `a`,
           the grad is stored in `a.buffer[gradkey]`.
    """
    tape = []
    with my_func_tracker.track_func(True, tape=tape):
        # do computations and track in tape
        y = f(*inputs)
    # forward propagate gradient starting at inputs
    forwardAD_along_tape(inputs, tape, inputs_v, gradkey=gradkey)
    return y.buffer[gradkey]

def reverseAD(
    f: Callable[[list[MyTensor]], MyTensor],
    inputs: list[MyTensor],
    v: MyTensor,
    *,
    gradkey: str = "grad",
) -> list[MyTensor]:
    """Use reverse-mode AD to compute the vector-Jacobian product of f.
    Return the gradient of dot(f, v) evaluated at inputs.

    Args
    ----
    - `f`: The function to be differentiated.

    - `inputs`: Inputs of `f`.

    - `v`: Any tensor matches the dim of `f`.

    - `gradkey`: A string used for the dict key. For a given tensor `a`,
           the grad is stored in `a.buffer[gradkey]`.

    Note
    ----
    The gradient of tensor `a` is accumulated in `a.bffer[gradkey]`, which is
    zero by default. However, this function does not check whether it is zero or
    not. It simply accumulates all gradient in it.
    """
    tape = []
    with my_func_tracker.track_func(True, tape=tape):
        # do computations and track in tape
        y = f(*inputs)
    # backpropagate gradient starting at y
    reverseAD_along_tape(y, tape, v, gradkey=gradkey)
    return [x.buffer[gradkey] for x in inputs]
#+END_SRC

There is also a =Test= class, which contains various functions and their
derivative functions derived by hand. For example, $$ f(w; X, y) =
L(s(Xw), y), $$ where $$s(x) = 1/(1 + e^{-x}), \quad L(p, y) = -\sum[ y_i
\log p_i + (1-y_i)\log (1-p_i)]$$ are sigmoid function and binary
cross entropy loss. $X\in\mathbb{R}^{n\times m}$ is the predictor matrix and $y\in\mathbb{R}^n$
is the response. It is not hard to show that $$\partial_w f = (p-y)^\intercal X,
\quad \partial^2_w f = X^\intercal \Omega X,$$ where $p=s(Xw)$ and $\Omega =
\operatorname{diag}(p(1-p))$.

