2024-09-24-ImplementBP/notes.html
<div id="outline-container-org6fd5062" class="outline-2">
<h2 id="org6fd5062">Appendix: Overview of the Python Implementation</h2>
<div class="outline-text-2" id="text-org6fd5062">
<p>
<a id="orgb898803"></a>
</p>

<p>
The complete code is available at <a href="https://github.com/Dou-Meishi/audi">this github repo</a>.  The overall
framework follows <a href="https://colab.research.google.com/drive/1VpeE6UvEPRz9HmsHh1KS0XxXjYu533EC">this colab notebook</a>.  Basically, I implement the
following data structures.
</p>

<ol class="org-ol">
<li><p>
<code>MyFunction</code>. This models the elementary operations, such as addition,
multiplication, division, subtraction, matrix multiplication and so
on.  Instances of this class have attributes <code>vjp</code> and <code>jvp</code>, which are
responsible for computing vector-Jacobian products and
Jacobian-vector products.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MyFunction</span>(<span style="color: #657b83; font-weight: bold;">object</span>):
    <span style="color: #2aa198;">"""Functions with vjp and jvp as attributes."""</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>, name, func, func_vjp=<span style="color: #268bd2; font-weight: bold;">None</span>, func_jvp=<span style="color: #268bd2; font-weight: bold;">None</span>):
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">name</span> = name
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">func</span> = func
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">vjp</span> = func_vjp
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">jvp</span> = func_jvp

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__call__</span>(<span style="color: #859900; font-weight: bold;">self</span>, *args, **kws):
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">self</span>.func(*args, **kws)
</pre>
</div></li>

<li><p>
<code>MyFunctionTracker</code>. This is a decorator class to track inputs and
outputs of elementary operations, designed for the class
<code>MyFunction</code>.  The global instance <code>my_func_tracker</code> decorates the
<code>MyFunction.__call__</code> method. By doing so, each call of the
elementary operations will be recorded in
<code>my_func_tracker.call_tape</code>. Moreover, the method <code>track_func</code> returns
a context manager for conveniently toggling traking functionality.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MyFuncTracker</span>(<span style="color: #657b83; font-weight: bold;">object</span>):
    <span style="color: #2aa198;">"""A decorator class to track function inputs and outputs.</span>
<span style="color: #2aa198;">    Designed for MyFunction class.</span>

<span style="color: #2aa198;">    Store recorded calls in attribute `call_tape`, a list of tuples</span>
<span style="color: #2aa198;">    representing (inputs_k, outputs_k, func_k).</span>

<span style="color: #2aa198;">    Args:</span>
<span style="color: #2aa198;">        do_track (bool): A boolean flag to determine whether tracking is enabled.</span>
<span style="color: #2aa198;">    """</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>, do_track: <span style="color: #657b83; font-weight: bold;">bool</span>):
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">do_track</span> = do_track
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">call_tape</span> = []

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__call__</span>(<span style="color: #859900; font-weight: bold;">self</span>, func):
        <span style="color: #2aa198;">"""Wrap the function to track inputs and outputs in `self.call_tape`.</span>
<span style="color: #2aa198;">        Expect func receive self as its first argument."""</span>
        <span style="color: #859900; font-weight: bold;">pass</span>

    <span style="color: #b58900;">@contextmanager</span>
    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">track_func</span>(<span style="color: #859900; font-weight: bold;">self</span>, do_track: <span style="color: #657b83; font-weight: bold;">bool</span>, tape: Union[<span style="color: #268bd2; font-weight: bold;">None</span>, <span style="color: #657b83; font-weight: bold;">list</span>] = <span style="color: #268bd2; font-weight: bold;">None</span>):
        <span style="color: #2aa198;">"""Context manager to enable or disable tracking within a block.  If</span>
<span style="color: #2aa198;">        tape is not None, store records in it. Otherwise, store records in</span>
<span style="color: #2aa198;">        `self.call_tape`."""</span>
        <span style="color: #859900; font-weight: bold;">pass</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">initialize a global function tracker</span>
<span style="color: #268bd2;">my_func_tracker</span> = MyFuncTracker(do_track=<span style="color: #268bd2; font-weight: bold;">True</span>)
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">apply it to MyFunction class</span>
MyFunction.<span style="color: #268bd2;">__call__</span> = my_func_tracker(MyFunction.__call__)
</pre>
</div></li>

<li><p>
<code>MyTensor</code>. This models the variables for inputs and outputs of
elementary operations. Instances of this class comprise, <code>value</code> for
a NumPy array and <code>buffer</code> for a dictionary. Arithmetic operators of
this class are overloaded by <code>MyFunction</code> instances following the
instructions mentioned in the Python documentation <a href="https://docs.python.org/3/reference/datamodel.html#emulating-numeric-types">Emulating
numeric types</a>.  By doing so, calculations involving <code>MyTensor</code>
instances will be recorded by <code>my_func_tracker</code> automatically.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MyTensor</span>(<span style="color: #657b83; font-weight: bold;">object</span>):
    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>, value=0):
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">value</span> = np.asarray(value)
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #657b83; font-weight: bold;">buffer</span> = defaultdict(<span style="color: #859900; font-weight: bold;">self</span>.default_grad)

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">default_grad</span>(<span style="color: #859900; font-weight: bold;">self</span>):
        <span style="color: #859900; font-weight: bold;">return</span> MyTensor(np.zeros_like(<span style="color: #859900; font-weight: bold;">self</span>.value))

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__add__</span>(<span style="color: #859900; font-weight: bold;">self</span>, other):
        <span style="color: #859900; font-weight: bold;">pass</span>
</pre>
</div></li>
</ol>

<p>
There are two notable things when implementing these classes.
</p>

<ol class="org-ol">
<li><p>
The attributes <code>vjp</code> and <code>jvp</code> of <code>MyFunction</code> instances are
functions. These functions accepts <code>MyTensor</code> inputs and return
<code>MyTensor</code> outputs, utilizing operations exclusively modelded by
<code>MyFunction</code> for tensor manipulation. Therefore, calculations
performed by <code>vjp</code> and <code>jvp</code> can be tracked by <code>my_func_tracker</code>, a
crucial aspect for computing high-order derivatives. Below is the
definition of addition along with its respective JVP/VJP
functionalities. Notably, the JVP propagates gradients of inputs to
gradient of outputs, while the VJP propagates gradient of outputs
to gradient of inputs.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">_add</span>(a: MyTensor, b: MyTensor) -&gt; MyTensor:
    <span style="color: #859900; font-weight: bold;">return</span> MyTensor(a.value + b.value)


<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">_add_vjp</span>(
    inputs: <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor], outputs: MyTensor, grad_outputs: MyTensor
) -&gt; <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor]:
    <span style="color: #859900; font-weight: bold;">return</span> (grad_outputs <span style="color: #859900; font-weight: bold;">for</span> _ <span style="color: #859900; font-weight: bold;">in</span> inputs)


<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">_add_jvp</span>(
    inputs: <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor], outputs: MyTensor, grad_inputs: <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor]
) -&gt; MyTensor:
    <span style="color: #859900; font-weight: bold;">return</span> grad_inputs[0] + grad_inputs[1]


<span style="color: #268bd2;">add</span> = MyFunction(<span style="color: #2aa198;">"Add"</span>, _add, func_vjp=_add_vjp, func_jvp=_add_jvp)
</pre>
</div></li>

<li><p>
Broadcast operations should be tracked too. As NumPy arrays can
broadcast their shape automatically, the function <code>_add</code> mentioned
earlier may receive a vector \(x\in\mathbb{R}^3\) and a scalar \(k\in\mathbb{R}\) and return
a new vector \(y=x+k\mathbb{1}\). Indeed, there is a broadcast operation \(k \mapsto
   k\mathbb{1}\in\mathbb{R}^3\) besides addition. Failing to record these broadcast
operations the gradient can lead to incorrect gradient
calculations. Below are the definitions of broadcast and addition
operations in <code>MyTensor</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">MyTensor</span>(<span style="color: #657b83; font-weight: bold;">object</span>):

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__add__</span>(<span style="color: #859900; font-weight: bold;">self</span>, other):
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900; font-weight: bold;">not</span> <span style="color: #657b83; font-weight: bold;">isinstance</span>(other, MyTensor):
            <span style="color: #268bd2;">other</span> = MyTensor(other)
        <span style="color: #268bd2;">a</span>, <span style="color: #268bd2;">b</span> = MyTensor.broadcast(<span style="color: #859900; font-weight: bold;">self</span>, other)
        <span style="color: #859900; font-weight: bold;">return</span> add(a, b)

    @<span style="color: #657b83; font-weight: bold;">staticmethod</span>
    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">broadcast</span>(*tensors):
        <span style="color: #268bd2;">shape</span> = np.broadcast_shapes(*[t.shape <span style="color: #859900; font-weight: bold;">for</span> t <span style="color: #859900; font-weight: bold;">in</span> tensors])
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #657b83; font-weight: bold;">tuple</span>(t.expand(shape=shape) <span style="color: #859900; font-weight: bold;">for</span> t <span style="color: #859900; font-weight: bold;">in</span> tensors)

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">_expand</span>(a: MyTensor, *, shape: <span style="color: #657b83; font-weight: bold;">list</span>[<span style="color: #657b83; font-weight: bold;">int</span>]) -&gt; MyTensor:
    <span style="color: #859900; font-weight: bold;">return</span> MyTensor(np.broadcast_to(a.value, shape))

<span style="color: #268bd2;">expand</span> = MyFunction(<span style="color: #2aa198;">"Expand"</span>, _expand, func_vjp=_expand_vjp, func_jvp=_expand_jvp)
</pre>
</div></li>
</ol>

<p>
Finally, forward-mode AD and reverse-mode AD can be implemented as
follows.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">forwardAD</span>(
    f: Callable[[<span style="color: #657b83; font-weight: bold;">list</span>[MyTensor]], MyTensor],
    inputs: <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor],
    inputs_v: <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor],
    *,
    gradkey: <span style="color: #657b83; font-weight: bold;">str</span> = <span style="color: #2aa198;">"grad"</span>,
) -&gt; MyTensor:
    <span style="color: #2aa198;">"""Use forward-mode AD to compute the Jacobian-vector product of f.</span>
<span style="color: #2aa198;">    Return the gradient of f(dot(v, x)) evaluated at inputs.</span>

<span style="color: #2aa198;">    Args</span>
<span style="color: #2aa198;">    ----</span>
<span style="color: #2aa198;">    - `f`: The function to be differentiated.</span>

<span style="color: #2aa198;">    - `inputs`: Inputs of `f`.</span>

<span style="color: #2aa198;">    - `inputs_v`: A list of tensor matches `inputs`.</span>

<span style="color: #2aa198;">    - `gradkey`: A string used for the dict key. For a given tensor `a`,</span>
<span style="color: #2aa198;">           the grad is stored in `a.buffer[gradkey]`.</span>
<span style="color: #2aa198;">    """</span>
    <span style="color: #268bd2;">tape</span> = []
    <span style="color: #859900; font-weight: bold;">with</span> my_func_tracker.track_func(<span style="color: #268bd2; font-weight: bold;">True</span>, tape=tape):
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">do computations and track in tape</span>
        <span style="color: #268bd2;">y</span> = f(*inputs)
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">forward propagate gradient starting at inputs</span>
    forwardAD_along_tape(inputs, tape, inputs_v, gradkey=gradkey)
    <span style="color: #859900; font-weight: bold;">return</span> y.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey]

<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">reverseAD</span>(
    f: Callable[[<span style="color: #657b83; font-weight: bold;">list</span>[MyTensor]], MyTensor],
    inputs: <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor],
    v: MyTensor,
    *,
    gradkey: <span style="color: #657b83; font-weight: bold;">str</span> = <span style="color: #2aa198;">"grad"</span>,
) -&gt; <span style="color: #657b83; font-weight: bold;">list</span>[MyTensor]:
    <span style="color: #2aa198;">"""Use reverse-mode AD to compute the vector-Jacobian product of f.</span>
<span style="color: #2aa198;">    Return the gradient of dot(f, v) evaluated at inputs.</span>

<span style="color: #2aa198;">    Args</span>
<span style="color: #2aa198;">    ----</span>
<span style="color: #2aa198;">    - `f`: The function to be differentiated.</span>

<span style="color: #2aa198;">    - `inputs`: Inputs of `f`.</span>

<span style="color: #2aa198;">    - `v`: Any tensor matches the dim of `f`.</span>

<span style="color: #2aa198;">    - `gradkey`: A string used for the dict key. For a given tensor `a`,</span>
<span style="color: #2aa198;">           the grad is stored in `a.buffer[gradkey]`.</span>

<span style="color: #2aa198;">    Note</span>
<span style="color: #2aa198;">    ----</span>
<span style="color: #2aa198;">    The gradient of tensor `a` is accumulated in `a.bffer[gradkey]`, which is</span>
<span style="color: #2aa198;">    zero by default. However, this function does not check whether it is zero or</span>
<span style="color: #2aa198;">    not. It simply accumulates all gradient in it.</span>
<span style="color: #2aa198;">    """</span>
    <span style="color: #268bd2;">tape</span> = []
    <span style="color: #859900; font-weight: bold;">with</span> my_func_tracker.track_func(<span style="color: #268bd2; font-weight: bold;">True</span>, tape=tape):
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">do computations and track in tape</span>
        <span style="color: #268bd2;">y</span> = f(*inputs)
    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">backpropagate gradient starting at y</span>
    reverseAD_along_tape(y, tape, v, gradkey=gradkey)
    <span style="color: #859900; font-weight: bold;">return</span> [x.<span style="color: #657b83; font-weight: bold;">buffer</span>[gradkey] <span style="color: #859900; font-weight: bold;">for</span> x <span style="color: #859900; font-weight: bold;">in</span> inputs]
</pre>
</div>

<p>
There is also a <code>Test</code> class, which contains various functions and their
derivative functions derived by hand. For example, \[ f(w; X, y) =
L(s(Xw), y), \] where \[s(x) = 1/(1 + e^{-x}), \quad L(p, y) = -\sum[ y_i
\log p_i + (1-y_i)\log (1-p_i)]\] are sigmoid function and binary
cross entropy loss. \(X\in\mathbb{R}^{n\times m}\) is the predictor matrix and \(y\in\mathbb{R}^n\)
is the response. It is not hard to show that \[\partial_w f = (p-y)^\intercal X,
\quad \partial^2_w f = X^\intercal \Omega X,\] where \(p=s(Xw)\) and \(\Omega =
\operatorname{diag}(p(1-p))\).
</p>
</div>
</div>
<div class="taglist"><a href="https://dou-meishi.github.io/org-blog/tags.html">Tags</a>: <a href="https://dou-meishi.github.io/org-blog/tag-ai.html">ai</a> </div>
<div id="comments"><script src="https://giscus.app/client.js"
        data-repo="Dou-Meishi/org-blog"
        data-repo-id="R_kgDOLJfSOw"
        data-category="Announcements"
        data-category-id="DIC_kwDOLJfSO84CkxDd"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light"
        data-lang="en"
        crossorigin="anonymous"
        async>
</script>
</div></div>
<div id="postamble" class="status">Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
</div>
</body>
</html>
